{
  "architectures": [
    "SegformerForSemanticSegmentation"
  ],
  "num_labels": 7,
  "attention_probs_dropout_prob": 0.0,
  "classifier_dropout_prob": 0.1,
  "decoder_hidden_size": 768,
  "depths": [
    3,
    4,
    6,
    3
  ],
  "downsampling_rates": [
    1,
    4,
    8,
    16
  ],
  "drop_path_rate": 0.1,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_sizes": [
    64,
    128,
    320,
    512
  ],
  "id2label": {
    "0": "urban_land",
    "1": "agriculture_land",
    "2": "rangeland",
    "3": "forest_land",
    "4": "water",
    "5": "barren_land",
    "6": "unknown"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "label2id": {
    "agriculture_land": 1,
    "barren_land": 5,
    "forest_land": 3,
    "rangeland": 2,
    "unknown": 6,
    "urban_land": 0,
    "water": 4
  },
  "layer_norm_eps": 1e-06,
  "mlp_ratios": [
    4,
    4,
    4,
    4
  ],
  "model_type": "segformer",
  "num_attention_heads": [
    1,
    2,
    5,
    8
  ],
  "num_channels": 3,
  "num_encoder_blocks": 4,
  "patch_sizes": [
    7,
    3,
    3,
    3
  ],
  "reshape_last_stage": true,
  "sr_ratios": [
    8,
    4,
    2,
    1
  ],
  "strides": [
    4,
    2,
    2,
    2
  ],
  "torch_dtype": "float32",
  "transformers_version": "4.51.3"
}
